package ru.great_larder.sportquiz.question;

import ru.great_larder.sportquiz.domain.Question;
import ru.great_larder.sportquiz.domain.QuestionEtiquetteSecular;

import java.util.ArrayList;
import java.util.Collections;
import java.util.List;

public class GetEtiquetteSecularInside {
    public List<QuestionEtiquetteSecular> getListQuestion(String value) {
            List<QuestionEtiquetteSecular> list = new ArrayList<>();
            list.add(new QuestionEtiquetteSecular(null,"Как нужно сидеть за столом?", "Прямо, непринужденно"
                , "Положив локти на стол", "Вытянув под столом ноги", "Оперевшись о стол", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Что едят руками?", "Хинкали"
                , "Котлеты", "Пельмени", "Картофель", "https://vk.com/wall-221127130_18", 1));
            list.add(new QuestionEtiquetteSecular(null,"Чем культурный человек вытирает рот после еды?", "Салфеткой"
                , "Ни чем", "Рукой", "Платком", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Что нельзя делать во время спектакля?", "Все перечисленное"
                , "Есть чипсы", "Разговаривать по телефону", "Бегать по залу", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Какое слово не является вежливым?", "Возьми"
                , "Спасибо", "Пожалуйста", "Благодарю", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"На что в театре можно смотреть в бинокль?", "На сцену"
                , "На себя", "На зрителей", "На соседа", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Что делать с чайной ложкой, после того как вы размешали сахар в чашке?", "Положить на блюдце"
                , "Оставить в чашке", "Держать в руке", "Положить на стол", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Когда можно садиться за праздничный стол?", "Когда пригласит хозяйка"
                , "Когда сам захочешь", "Когда никто не видит", "Когда погас свет", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Какие продукты можно брать руками?", "Хлеб и фрукты"
                , "Салаты и котлеты", "Сметану и майонез", "Суши и пельмени", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Кому в прежние времена разрешалось вплетать ленту в косу и завязывать бант?", "Незамужним женщинам"
                , "Мальчикам", "Мужчинам", "Замужним женщинам", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Когда вас просят передать соль, по этикету следует?", "Одновременно передать соль и перец"
                , "Передать соль", "Спросить, не нужно ли еще передать и перец", "Сделать вид, что не услышал", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Как передаются блюда за столом?", "Слева направо"
                , "Справа налево", "В порядке, который удобен сидящим", "В хаотичном порядке", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Ножи всегда передаются ручкой вперед, а как передаются ложки и вилки?", "Ложки и вилки тоже передаются ручкой вперед"
                , "Ложки следует перекладывать на сторону просящего по столу, вилки предают ручкой вперед", "Ложки и вилки передают зубцами и углублением вперед", "Они не передаются", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Дозволено ли этикетом отставлять мизинец вбок во время чаепития?", "Нет, это плохой тон"
                , "Зависит от того, в каком обществе пьется чай", "Дозволено", "Дозволено если так удобно", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"После окончания трапезы, что следует сделать с салфеткой?", "Сложить ее и положить слева от себя"
                , "Сложить ее и положить справа от себя", "Не складывать салфетку, оставив ее на стуле", "Положить на тарелку", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Когда следует приступать к еде за общим столом?", "Когда блюда подали всем сидящим за столом"
                , "Как только вам принесли ваше блюдо", "Когда вам удобнее начать есть", "Когда блюдо остынет", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Если в ресторане вы съели своё блюдо раньше остальных, то вам следует…?", "Дабы не торопить остальных, не складывать свои приборы так, чтобы официант забрал тарелку, но подождать, пока закончат все и после попросить унести пустые тарелки у всех"
                , "Приступить к другим блюдам, попросив официанта забрать у вас пустую тарелку", "Подождать пока официант заберет тарелку и не приступать к другим блюдам, пока не доедят остальные", "Позвать официанта и попросить следующее блюдо", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Допустимо ли откусывать от кусочка, если он наколот на вилку?", "Нет, недопустимо"
                , "Да, если кусок оказался слишком большим или слишком горячим", "Да, конечно, допустимо", "Да, если это рыба", null, 1));
            list.add(new QuestionEtiquetteSecular(null,"Если уроните вилку на банкете?", "Попросите официанта принести чистую вилку"
                , "Поднимете вилку", "Поднимете и пойдете помоете вилку", "Запихнете ногой под стол", null, 1));
            
            Collections.shuffle(list);
            
            return list;
    }
}
