package ru.great_larder.sportquiz.question;

import ru.great_larder.sportquiz.domain.QuestionBashkirLanguage;

import java.util.ArrayList;
import java.util.Collections;
import java.util.List;

public class GetQuestionBashkirLanguageInside {
	public List<QuestionBashkirLanguage> getListQuestion(String value) {
	List<QuestionBashkirLanguage> list = new ArrayList<>();
		
		list.add(new QuestionBashkirLanguage(null,"Сколько букв в башкирском алфавите:", "42"
				, "32", "33", "43", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Сколько самостоятельных частей речи в башкирском языке?", "6"
				, "5", "9", "7", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Определите группу башкирских специфических букв-звуков:", "ә, ө, һ, ҡ, ҙ, ң"
				, "а, ә, о, ө, г, ғ, ү", "з, ҙ, к, ҡ, с, ҫ", "о, ү, о, ө, л, м", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Найдите группу твёрдых гласных звуков:", "а, у, о, ы"
				, "ә, а, и, у, э", "й, е, р, о, ы", "у, а, ө, э, о", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Имена существительные отвечают на вопросы:", "кем? нимә?"
				, "нисә? ҡасан?", "ниндәй? ҡайһы?", "нисек? ни эшләй?", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Вкаком ряду указано правильное окончание существительных?", "Уҡыусы, балыҡсы, төҙөүсе, игенсе"
				, "укытыусе, баҡсасы, тәрбиәсы, итексе", "Гармунсы, эшсы, ташсе, йырсы", "Бейеүсы, ашнаҡсе, эшсе, укытыусы", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Найди правильный перевод на башкирском языке: Я начал ходить в спортивную школу.", "Мин спорт мәктәбенә йөрөй башланым"
				, "Миңә спорт мәктәбендә оҡшай", "Мин йөрөй башланы спорт мәктәбенә", "Мин спорт мәктәбенә йөрөйөм", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как переводится слово \"Кыҙыл\"?", "Красный"
				, "Дождь", "Крыша", "Синий", null, 1));
		list.add(new QuestionBashkirLanguage(null,"На башкирском языке призыв Вперед звучит как:", "Алға"
				, "Тик тор", "Белмәйем", "Артка", null, 1));
		list.add(new QuestionBashkirLanguage(null,"На вывеске продуктового магазина написано:", "Аҙык-түлек"
				, "Белмәйем", "Продуктылар", "Аш-һыу", null, 1));
		list.add(new QuestionBashkirLanguage(null,"\"Я-счастлив \" по-башкирски звучит как:", "Мин бәхетле"
				, "Һин бәхетле", "Ул бәхетле", "ҺеҘ бәхетле", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Все слова какой строчки отвечают на вопрос кто?", "Әсәй, ағай, укытыусы"
				, "Айыу, ҡуян, кәзә", "Малай, Һыйыр, Ҡош", "Алма, ҡыҙ, төлкө", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Сколько диалектов различают в башкирском языке?", "3"
				, "1", "7", "5", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Сколько падежей в башкирском языке?", "6"
				, "5", "4", "7", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡылымға хае булмаған грамматик категорияны билдәләгеҘ:", "Килеш"
				, "Һөйкәлеш", "Йүнәлеш", "Заман", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Һай, урманым, урманым, күпте күргән урмандарым минең! АҪтына ҺыҘылған һүҙ Һөйләмдең ниндәй киҫәге булып килә?", "Эйә"
				, "Исем", "Хәбәр", "Сифат", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Тартынҡы өндән башланған һүҙҙе күрһәтегеҙ", "Ялан"
				, "Аҡлан", "Ырымбур", "Әтәс", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Баҫымһыҙ ижектәрҙәге һуҙынҡыларҙың төшөп ҡалыуы нимә тип атала?", "Редукция"
				, "Элизия", "Эпентеза", "Протеза", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Кем һөнәрле, шул хөрмәткә эйә. Эйәрсән һәйләмдең төрөн билдәләгеҙ.", "эйә һөйләм"
				, "сәбәп һөйләм", "хәл һөйләм", "урын һөйләм", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Өсәү, етәү, унау һүҙҙәре ниндәй һан төркөмсәһенә ҡарай?", "Йыйыу"
				, "Бүлем", "Сама", "Рәт", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ниндәй һүҙҙә хата бар?", "Башҡортлыҡ"
				, "Уҡыусымын", "Ҡешеһең", "Кәләүем", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как будет ПРИВЕТ на башкирском языке?", "Сәләм"
				, "һаумыһығыҙ", "Хәйерле иртә", "һаумы", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как будет ЛЮБЛЮ на башкирском языке?", "Яратам"
				, "Хөрмәт итәм", "һагынам", "Яҡшылыҡ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как будет СОЛНЦЕ на башкирском языке?", "Ҡояш"
				, "Кояш", "Кән", "Күмер", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как будет ЦВЕТЫ на башкирском языке?", "Сәскә, гөл"
				, "Чечек", "Төҫ", "Тамсы", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как будет ЖИЗНЬ на башкирском языке?", "Все варианты"
				, "Тереклек", "Тормош", "Ғүмер", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как будет БЕСЕДА на башкирском языке?", "Әңгәмә"
				, "Алдашыу", "Шаяртыу", "Уҡыу", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Как будет ВНЕШНОСТЬ на башкирском языке?", "Ҡиәфәт"
				, "Ҡул", "Ғәҙәт", "Баш", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Көмөш һүҙе ҡайһы осраҡта тура мәғәнәһендә ҡулланылған?", "көмөш ҡалаҡ"
				, "көмөш туй", "көмөш сәс", "көмөш боҙ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Апайымдың кәйефе шәп ине. Билдәләнгән һүҙҙәр ниндәй һүҙбәйләнеш төрөнә - ҡарай?", "һөйкәлеү"
				, "йәнәшәлек", "башҡарылыу", "ярашыу", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Яҙылышы ҡағиҙәгә тап килмәгән вариантты табығыҙ:", "фестивальдә"
				, "артискаһы", "лозунгыһы", "лагеры", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Өфө ҡалаһында нисә район бар?", "7"
				, "5", "3", "6", null, 1));
		list.add(new QuestionBashkirLanguage(null,"\"Ер шарының картаһына ҡараһаң яҡшы ғына...\"Был шиғыр юлдарының авторы кем?", "Мостай Кәрим"
				, "Рауил Бикбаев", "Назар Нәжми", "Сафуан Әлибай", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Белдергән мәғәнәләре буйынса бер төркөмгә берләштерергә мөмкин булған һүҙҙәр яҙылған юлды билдәләгеҙ.", "имән, саған, ҡайын"
				, "хоҡуҡ, холоҡ, хужа", "ауыл, тау, хеҙмәт", "Өфө, ҡала, исем", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Какая часть речи отсутствует в башкирском языке?", "предлоги"
				, "наречие", "числительные", "определение", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Вкаком году башкирский язык получил статус \"уязвимый\"?", "2009"
				, "2020", "1989", "1998", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Кто является основоположником башкирской филологии?", "КиекбаевД.Г."
				, "Давлетшин Г.Я.", "Мустай Карим", "М.Акмулла", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Прародитель журнала \"Агидель\", издававшийся с марта 1923 года ?", "Яцы юл"
				, "Ленин юлы", "Янылык", "Яны юл", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Какой детский журнал на башкирском языке отметил в январе 2021 года свое 30 - летие?", "Акбузат"
				, "Аманат", "Ватандаш", "Йэншишмэ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"На какой слог стремится словесное ударение в башкирском языке?", "на последний"
				, "на первый", "на средний", "всегда по-разному", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Крупнейшее издательство, выпускающее книги на башкирском языке?", "Китап"
				, "Белый город", "Воймега", "Башгиз", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡайһы төркөмдә ҡушма һүҙҙәр бирелгән?", "Ойоҡбаш, ташбаш, Ағиҙел"
				, "Башҡаса, башланы, башҡа", "Башаҡлы, башлыҡ, башлыса", "Башланғыс, иң баштан, башалтай", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡайһы төркөмдәге һүҙҙәр ҡуш тартынҡыға бөткән?", "Металлы, килограмға"
				, "Вахтерҙың, шахтерҙан", "Гимназиста, лозунгыла", "Космонавҡа, отрядты, танкыға", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡылымдарҙың ҡайһыһы үткән заманда берлектә өсөнсө затта килгән?", "Эшләне, йөрөнө,уҡыны"
				, "Эшләнек, йөрөнөк, уҡыныҡ", "Эшләнегеҙ, йөрөнөгөҙ, уҡынығыҙ", "лагеры", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Түбәндә баш киҫәктәрҙән төҙөлгән һөйләмде күрһәт?", "Машиналар йөрөй"
				, "Ҡала урамында", "Ҡала урамында йөрөй", "Йыш йөрөй", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ауылда көҙгө эштәр яцы ғына тамамланғайны һөйләмендә ҡайһы һүҙ аныҡлаусы булып килгән?", "Көҙгө"
				, "Ауылда", "Эштәр", "Яңы ғына", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Рәшит һәр китапты мауығып укый һөйләмендә тултыусыны тап.", "Китапты"
				, "Рәшит", "Мауығып", "Уҡый", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Көҙөн күл тирәһе матурлығын юғалтты һөйләмендә хәлде тап.", "Көҙөн"
				, "Күл тирәһе", "Матурлығын", "Юғалтты", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Уҡыусылар шиҡыр һөйләнеләр, йырланылар, бейенеләр һөйләмендә һөйләм киҫәктәренең ҡайһыһы тиң булып килгән?", "Хәбәр"
				, "Эйә", "Аныҡлаусы", "Тултырыусы", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Алмаз китаптарын, дәфтәрҙәрен, портфеленә һалды һөйләмендә һөйләм киҫэктәренең ҡайһы киҫәге тиң булып килгән ?", "Тултырыусы"
				, "Эйә", "Аныҡлаусы", "Хәл", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Гөлсирә менән Ғәлимә сәхнәлә бик матур итеп бейенеләр. Был һөйләмдең ҡайһы киҫәге тиң булып килгэн?", "Эйә"
				, "Хәбәр", "Аныҡлаусы", "Хәл", null, 1));
		list.add(new QuestionBashkirLanguage(null,"\"Малайҙар, ҡайҙа бараһығыҙ?\" - тип һораны ҡыҙҙар. Һөйләмендә ҡайһыһы өндәш һүҙ?", "Малайҙар"
				, "Ҡайҙа", "Ҡыҙҙар", "Һораны", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Әкрен генә ел иҫте, япраҡтар шыбырлаша башланы, ҡояш болот артына йәшенде. Был ниндәй һөйләм?", "Ҡушма һөйләм"
				, "Ябай", "һорау һөйләм", "Өндәү һөйләм", null, 1));
		list.add(new QuestionBashkirLanguage(null,"\"Шауламағыз әле!\" -тип ҡыскырҙы Вәсилә. Аҫтына һыҙылған һүҙҙәр һөйләмдең ниндәй өлөшөн тәшкил итә?", "Тура телмәр"
				, "Автор һүҙе", "Өндәш һүҙ", "Инеш һүҙ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"-Ҡайҙа бараһығыҙ? - Мәктәпкә.- Унда бөгөн нимә була? Был ниндәй телмәр ?", "Диалог"
				, "Автор һүҙе", "Тура телмәр", "Өндәш һүҙ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Урман(да), ялан(да) көҙ тулыһынса хужа булып алған. Йәйә эсендәге һүҙ өлөшө нимә ул?", "Урын-ваҡыт килеш ялғауы"
				, "Ярҙамсы һүҙ", "Ижек", "Өндәш һүҙ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Урман (да), ялан (да), баҫыуҙар (ҙа), киң ҡырҙар(ҙа) коҙ тәрән йоҡоға сумған. Һөйләмдә йәйә эсендәге һүҙ өлөшө нимө ул?", "Ярҙамсы һүҙ"
				, "Ижек", "Урын-ваҡыт килеш ялғауы", "Өндәш һүҙ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Телмәр өндәрен ниндәй фән өйрәнә?", "Фонетика"
				, "Графика", "Лексика", "Синтаксис", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Телмәрҙең иң ҡыҫка берәмеге нисек атала?", "Өн"
				, "Хәреф", "Ижек", "һүҙ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Алма һүҙендәге \"а\" ниндәй өн?", "һуҙынҡы"
				, "Тартынҡы", "Талғын", "Нәҙек", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Алтын һүҙе ҡайһы осраҡта тура мәғәнәлә ҡулланыла?", "Алтын балдаҡ"
				, "Алтын көҙ", "Алтын туй", "Аҡылың алтын икән", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Яһалма һүҙҙе билдәлә?", "күҙлек"
				, "сәскәләр", "башҡортмон", "Эште", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡайһы юлдағы һүҙҙәр тик тамырҙаш һүҙҙәр?", "Елдең, елгә, елдән, елдә"
				, "Күҙле, күҙлек, күҙәнәк", "Уҡы, уҡсы, уҡыусы", "Осло, осонда, осоусы", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡайһы төркөмдәге сифаттар аҙһытыу дәрәжәһендә килгән?", "Ҡыҙғылт, аҡһыл, йәшкелт"
				, "Ҡыҙыл, аҡ, йәшел", "Ҡыҙылыраҡ, ағыраҡ, йәшелерәк", "Ҡып-ҡыҙыл, ап-аҡ, үтә йәшел", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Түбәндәге эйәреүсе һүҙҙәр ниндәй һүҙ төркөмөнән килгән: йәшел ағас, шәп ат,ҡалын дәфтәр?", "Сифаттан"
				, "Исемдән", "Рәүештән", "Алмаштан", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡушма һүҙҙәр ҡайһы юлда дөрөҫ яҙылған?", "көньяҡ"
				, "көняҡ", "көнъяҡ", "ҡөньяҡ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Ҡушма һүҙҙәр ҡайһы юлда дөрөҫ яҙылған?", "ҡулъяулыҡ"
				, "ҡульяулыҡ", "ҡуляулыҡ", "кульяулыҡ", null, 1));
		list.add(new QuestionBashkirLanguage(null,"Әйәрсән киҫәктәр өс төрлө була:", "аныҡлаусы, тултырыусы, хәл"
				, "сифат, тултырыусы, хәл", "аныҡлаусы, тултырыусы, хәбәр", "аныҡлаусы, сифат, хәбәр", null, 1));
		
		Collections.shuffle(list);
	
	return list;
	}
}
